
#include <iostream>
using namespace std;
string name = "Danil";

int main() {
    cout << pow(3, 10) << endl;
    cout << name << endl;
    return 0;
}

//////////////fggf

#include <stdio.h>


using RUB = unsigned long long int;


struct Person {
    RUB cash;
    RUB salary;
};

struct Person alice;


void alice_init()
{
    alice.cash = 20'000;
    alice.salary = 80'000;
}


void alice_salary(const int year, const int month)
{
    if (year == 2026 and month == 12) {  // promotion
        alice.salary = 120'000;
    }

    alice.cash += alice.salary;
}


void alice_print()
{
    printf("Alice cash = %llu\n", alice.cash);
}


void simulation()
{
    int year = 2026;
    int month = 9;
    while (not (year == 2027 and month == 9)) {

        alice_salary(year, month);
        // alice_car();
        // alice_mortgage();
        // alice_cat();
        // alice_rent();
        // alice_tax();
        // alice_bank_income();

        // bob_salary();

        ++month;
        if (month == 13) {
            ++year;
            month = 1;
        }
    }
}


int main()
{
    alice_init();

    simulation();

    alice_print();
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"  Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

 

// Задание 01. "Alice and Bob"
//Нужно написать программу моделирующую жизнь человека(одного или двух).
//Ключевой аспект моделирования : финансовое состояние, т.е.деньги.
//
//Моделирование должно учитывать :
//+доходы
//1. зарплата(может быть две работы)
//2. проценты по накоплениям
//3. возврат налогов
//+ расходы
//1. еда
//2. коммуналка
//3. ипотека
//4. аренда
//5. домашнее животное(на время его жизни)
//6. машина
//+ инфляцию(индивидуальная для еды, коммуналки и т.д.)
//
//Время симуляции : полная выплата ипотеки(т.е.от 10 лет)
//Шаг симуляции : не больше месяца
//
//Технические требования :
//+объем программы(пустые строки учитываются)
//1. 2000 строк если есть принят за месяц(возможно с последующим исправлением недочетов)
//2. 3000 строк если сдаете в последний месяц семестра
//+ содержание
//1. не более 30 % кода занимают структуры данных
//2. одну тему промоделировать детально, варинты:
//-открытие ПВЗ
//- кредитование(несколько кредитов)
//- здоровое питание
//- и т.д.
//
//Качество кода :
//1. глядя на маленький кусок программы должно быть понятно, что учтено в моделировании
//2. код читаемый и понятный(одногруппник может легко добавить что - то в моделирование)
//3. придерживаться стиля оформления(snake - style)
//4. добавление новых деталей в моделировани не должно противоречить архитектуре программы
//
//
//Моделирование должно соответствовать реальному миру(разумеется, не абсолютно точно).
//
//
//Программа должна позволять делать выводы(хотя бы один из) :
//    1. хорошая модель жизни у Алисы или плохая
//    2. что лучше : взять ипотеку или копить на покупку
//    3. A / B тестирование двух моделей жизни(со случайными событиями)
//
//
//    PS :
//    1. использовать код сгенерированный AI настоятельно не рекоммендуется
//    2. можно использовать любой функционал С или C++ (из стандартной библиотеки)
//    3. можно написать на чистом С

